---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.FluidTemperatureSetIterator.MoveNext
source: html/94e96714-7fdc-900c-9827-2d46dbddd22e.htm
---
# Autodesk.Revit.DB.Plumbing.FluidTemperatureSetIterator.MoveNext Method

Increments the iterator to the next item.

## Syntax (C#)
```csharp
public virtual bool MoveNext()
```

## Returns
True if there is a next available item in this iterator.
 False if the iterator has completed all available items.